# 1)
num1 = int(input("1) შეიყვანე რიცხვი: "))
if num1 < 10:
    print("რიცხვი 10-ზე ნაკლებია")
else:
    print("რიცხვი 10-ზე მეტი ან ტოლია")

# 2)
num2 = int(input("2) შეიყვანე რიცხვი: "))
if num2 % 2 == 0:
    print("ეს რიცხვი ლუწია")
else:
    print("ეს რიცხვი კენტია")

# 3)
num3 = int(input("3) შეიყვანე რიცხვი: "))
if num3 > 0:
    print("რიცხვი დადებითია")
else:
    print("რიცხვი არ არის დადებითი")

# 4)
a = int(input("4) შეიყვანე პირველი რიცხვი: "))
b = int(input("შეიყვანე მეორე რიცხვი: "))
if a == b:
    print("ორივე რიცხვი ტოლია")
else:
    print("რიცხვები განსხვავებულია")

# 5)
num5 = int(input("5) შეიყვანე რიცხვი: "))
if num5 > 100 and num5 % 2 == 0:
    print("რიცხვი 100-ზე მეტია და ლუწია")
else:
    print("რიცხვი ან 100-ზე ნაკლებია, ან კენტია")

# 6)
num6 = int(input("6) შეიყვანე რიცხვი: "))
if num6 % 5 == 0 or num6 % 10 == 0:
    print("რიცხვი არის 5-ის ან 10-ის ჯერადი")
else:
    print("რიცხვი არც 5-ის და არც 10-ის ჯერადია")