# 1)
names = ["ნიკო", "ანა", "ლუკა", "მარი", "გიორგი"]
names.pop(0)      # 1.1 ამოიღებს პირველ ელემენტს ("ნიკო")
names.pop(-1)     # 1.2 ამოიღებს ბოლო ელემენტს ("გიორგი")
print("1) განახლებული სია:", names)

# 2)
names = ["ანა", "ლუკა"]

names.insert(1, "ნიკო")   # insert(index, value) – ამატებს ელემენტს კონკრეტულ ადგილას
names.append("მარი")      # append(value) – ამატებს ელემენტს სიის ბოლოში
names.pop()               # pop() – შლის ბოლო ელემენტს
length = len(names)       # len() – აბრუნებს სიის სიგრძეს

print("2) სია ფუნქციების შემდეგ:", names)
print("2.5) სიის სიგრძე:", length)

# 3)
names = ["ანა", "ლუკა", "მარი", "გიორგი", "თეკლა"]
names.insert(2, "დავითი")  # მეორე ინდექსზე ჩასვამს "დავითი"
print("3) განახლებული სია:", names)